{"_ASim_AuditEvent_MicrosoftWindowsEventsV01": {"body": "let parser = (disabled:bool = false) {\r\n  union \r\n  (\r\n      union \r\n      (\r\n          SecurityEvent\r\n          | where not(disabled)\r\n          | project EventID, EventData, _ResourceId, TimeGenerated, Computer, Type\r\n          | where EventID == 1102\r\n      ),\r\n      (\r\n          Event\r\n          | where not(disabled)\r\n          | project EventID, EventData, _ResourceId, TimeGenerated, Computer, Type\r\n          | where EventID == 1102\r\n      )\r\n      | parse-kv EventData as \r\n          (\r\n              SubjectUserSid:string,\r\n              SubjectUserName:string,\r\n              SubjectDomainName:string,\r\n              SubjectLogonId:string\r\n          ) \r\n          with (regex=@'<(\\w+)>([^<]*)<')\r\n      | project-away EventData\r\n  ),\r\n  (\r\n      WindowsEvent \r\n      | where not(disabled)\r\n      | project EventID, EventData, _ResourceId, TimeGenerated, Computer, Type\r\n      | where EventID == 1102\r\n      | extend\r\n          SubjectUserSid = tostring(EventData.SubjectUserSid),\r\n          SubjectUserName = tostring(EventData.SubjectUserName),\r\n          SubjectDomainName = tostring(EventData.SubjectDomainName),\r\n          SubjectLogonId = tostring(EventData.SubjectLogonId)\r\n      | project-away EventData\r\n  )\r\n  | project-rename\r\n      ActorUserId = SubjectUserSid,\r\n      DvcHostname = Computer,\r\n      ActorSessionId = SubjectLogonId,\r\n      DvcId = _ResourceId\r\n  | extend\r\n      EventCount = int(1),\r\n      EventType = \"Delete\",\r\n      Operation = \"Delete Logs\",\r\n      Object = \"Logs\",\r\n      EventResult = \"Success\",\r\n      EventStartTime = TimeGenerated, \r\n      EventEndTime= TimeGenerated,\r\n      EventProduct = 'Windows',\r\n      EventVendor = 'Microsoft',\r\n      EventSchemaVersion = '0.1.0',\r\n      EventSchema = 'AuditEvent',\r\n      ActorUserIdType = 'SID',\r\n      ActorUsername = iff (SubjectDomainName == \"\", SubjectUserName, strcat (SubjectDomainName, '\\\\', SubjectUserName)),\r\n      ActorUsernameType = iff (SubjectDomainName == \"\", 'Simple', 'Windows'),\r\n      DvcIdType = iff (DvcId == \"\", \"\", \"AzureResourceID\"),\r\n      EventOriginalType = tostring(EventID)\r\n  // Aliases\r\n  | extend \r\n      User=ActorUsername,\r\n      ActorUserSid = ActorUserId,\r\n      Dvc = DvcHostname\r\n  | project-away Subject*, EventID\r\n};\r\nparser (disabled=disabled)", "params": "disabled:bool = false"}}