{"_ASim_WebSession_PaloAltoCEFV01": {"body": "let parser=(disabled:bool=false){\r\n    let EventLookup=datatable(DeviceAction:string, DvcAction:string,EventResult:string,HttpStatusCode:string)\r\n    [\r\n        \"alert\", \"Allow\", \"Success\",\"200\"\r\n        , \"allow\", \"Allow\", \"Success\", \"200\"\r\n        , \"continue\", \"Allow\", \"Success\", \"200\"\r\n        , \"override\", \"Allow\", \"Success\", \"200\"\r\n        , \"block-continue\", \"Allow\", \"Partial\", \"200\"\r\n        , \"block-url\", \"Deny\", \"Failure\", \"503\"\r\n        , \"block-override\", \"Deny\", \"Failure\", \"302\"\r\n        , \"override-lockout\", \"Deny\", \"Failure\",\"503\"\r\n        , \"reset client\", \"Reset Source\", \"Failure\", \"503\"\r\n        , \"reset server\", \"Reset Destination\", \"Failure\", \"503\"\r\n        , \"reset both\", \"Reset\", \"Failure\", \"503\"\r\n        , \"deny\", \"Deny\", \"Failure\", \"503\"\r\n        , \"drop\", \"Drop\", \"Failure\", \"503\"\r\n        , \"drop ICMP\", \"Drop ICMP\", \"Failure\", \"503\"\r\n    ];\r\n    let SeverityLookup=datatable(LogSeverity:string,EventSeverity:string)\r\n    [   1, \"Informational\" \r\n        , 2, \"Low\" \r\n        , 3, \"Medium\"\r\n        , 4, \"Medium\" \r\n        , 5, \"High\"\r\n    ];\r\n    CommonSecurityLog\r\n    | where DeviceVendor == \"Palo Alto Networks\"\r\n        and DeviceProduct == \"PAN-OS\"\r\n        and Activity == \"THREAT\"\r\n        and DeviceEventClassID == \"url\"\r\n    | parse-kv AdditionalExtensions as (PanOSXForwarderfor:string, PanXFFIP:string, PanOSReferer:string, PanOSRuleUUID:string, PanSrcHostname:string, PanSrcMac:string, PanSrcDeviceCat:string, PanSrcDAG:string, PanOSSrcUUID:string, PanSrcDeviceProf:string, PanSrcDeviceModel:string, PanSrcDeviceVendor:string, PanSrcDeviceOS:string, PanSrcDeviceOSv:string, PanDstHostname:string, PanDstMac:string, PanDstDeviceCat:string, PanDstDAG:string, PanOSDstUUID:string, PanDstDeviceProf:string, PanDstDeviceModel:string, PanDstDeviceVendor:string, PanDstDeviceOS:string, PanDstDeviceOSv:string) with (pair_delimiter=';', kv_delimiter='=')\r\n    | extend \r\n        HttpRequestXff            = coalesce(PanOSXForwarderfor, PanXFFIP)\r\n    | lookup EventLookup on DeviceAction\r\n    | lookup SeverityLookup on LogSeverity\r\n    | project-rename \r\n        DvcHostname                 = Computer\r\n        , HttpReferrer                = PanOSReferer\r\n        , DstMacAddr                = PanDstMac\r\n        , SrcMacAddr                = PanSrcMac\r\n        , DstHostname               = PanDstHostname\r\n        , SrcHostname               = PanSrcHostname\r\n        , Url                       = RequestURL\r\n        , DvcId                     = DeviceExternalID\r\n        , SrcZone                   = DeviceCustomString4\r\n        , DstZone                   = DeviceCustomString5\r\n        , UrlCategory               = DeviceCustomString2\r\n        , DvcOriginalAction         = DeviceAction\r\n        , EventUid                  = _ItemId\r\n        , EventOriginalSeverity     = LogSeverity\r\n        , EventProductVersion       = DeviceVersion\r\n        , DvcInboundInterface       = DeviceInboundInterface\r\n        , DvcOutboundInterface      = DeviceOutboundInterface\r\n        , DstIpAddr                 = DestinationIP\r\n        , DstPortNumber             = DestinationPort\r\n        , SrcIpAddr                 = SourceIP\r\n        , SrcPortNumber             = SourcePort\r\n        , SrcUsername               = SourceUserName\r\n        , DstUsername               = DestinationUserName\r\n        , NetworkRuleName           = DeviceCustomString1\r\n        , ThreatOriginalConfidence  = ThreatConfidence\r\n        , DstNatIpAddr              = DestinationTranslatedAddress\r\n        , DstNatPortNumber          = DestinationTranslatedPort\r\n        , SrcNatIpAddr              = SourceTranslatedAddress\r\n        , SrcNatPortNumber          = SourceTranslatedPort\r\n    | extend\r\n        Dvc                         = DvcHostname\r\n        , DvcIdType                 = \"Other\"\r\n        , EventType                 = \"HTTPsession\"\r\n        , EventSchema               = \"WebSession\"\r\n        , EventSchemaVersion        = \"0.2.5\"\r\n        , EventProduct              = \"Palo Alto\"\r\n        , EventVendor               = \"PanOS\"\r\n        , EventStartTime            = TimeGenerated\r\n        , EventEndTime              = TimeGenerated\r\n        , HttpRequestMethod         = toupper(RequestMethod)\r\n        , EventResultDetails        = \"NA\"\r\n        , HttpContentFormat         = RequestContext\r\n        , DstFQDN                   = iif(Url contains \":\", split(tostring(split(trim('\"',Url),\"/\")[0]),\":\")[0],tostring(split(trim('\"',Url),\"/\")[0]))\r\n        , DstDomainType             = \"FQDN\"\r\n        , Src                       = SrcIpAddr\r\n        , SrcUsernameType           = \"Windows\"\r\n        , DstUsernameType           = \"Windows\"\r\n        , NetworkProtocolVersion    = case(\r\n            DstIpAddr contains \".\"  , \"IPv4\"\r\n            , DstIpAddr contains \":\", \"IPv6\"\r\n            , \"\")\r\n        , NetworkDirection          = case(\r\n            FlexString2 == \"client-to-server\", \"Outbound\"\r\n            , FlexString2 == \"server-to-client\", \"Inbound\"\r\n            , \"\")\r\n        , IpAddr                    = SrcIpAddr\r\n        , NetworkProtocol           = toupper(Protocol)\r\n        , User                      = SrcUsername\r\n        , Rule                      = NetworkRuleName\r\n        , NetworkSessionId          = tostring(DeviceCustomNumber1)\r\n        , DvcInterface              = DvcInboundInterface\r\n        , Hostname                  = DstHostname\r\n    | extend \r\n        SessionId                 = NetworkSessionId\r\n        , ThreatField               = case(\r\n          isnotempty(ThreatOriginalConfidence) and NetworkDirection == \"Outbound\", \"SrcIpAddr\"\r\n          , isnotempty(ThreatOriginalConfidence) and NetworkDirection == \"Inbound\", \"DstIpAddr\"\r\n          , \"\")\r\n        , Dst                       = DstFQDN\r\n    | extend \r\n        ThreatIpAddr                = case(\r\n          ThreatField == \"SrcIpAddr\", SrcIpAddr\r\n        , ThreatField == \"DstIpAddr\", DstIpAddr\r\n        , \"\")\r\n    | project DeviceVendor, Dst, DstDomainType, DstFQDN, DstHostname, DstIpAddr, DstMacAddr, DstNatIpAddr, DstNatPortNumber, DstPortNumber, DstUsername, DstUsernameType, DstZone, Dvc, DvcAction, DvcHostname, DvcId, DvcIdType, DvcInboundInterface, DvcInterface, DvcOriginalAction, DvcOutboundInterface, EventCount, EventEndTime, EventOriginalSeverity, EventProduct, EventProductVersion, EventResult, EventResultDetails, EventSchema, EventSchemaVersion, EventSeverity, EventStartTime, EventType, EventUid, EventVendor, Hostname, HttpContentFormat, HttpRequestMethod, HttpRequestXff, HttpStatusCode, IpAddr, NetworkDirection, NetworkProtocol, NetworkProtocolVersion, NetworkRuleName, NetworkSessionId, Protocol, RequestContext, RequestMethod, Rule, SessionId, Src, SrcHostname, SrcIpAddr, SrcMacAddr, SrcNatIpAddr, SrcNatPortNumber, SrcPortNumber, SrcUsername, SrcUsernameType, SrcZone, ThreatField, ThreatIpAddr, ThreatOriginalConfidence, TimeGenerated, Type, Url, UrlCategory, User\r\n};\r\nparser (disabled)", "params": "disabled:bool = false"}}