{"_Im_AuditEvent_MicrosoftExchangeAdmin365V02": {"body": "let usertypes=datatable (ActorOriginalUserType:string, ActorUserType:string)\r\n[\r\n // Regular, Regular\r\n \"Admin\", \"Admin\"\r\n , \"DcAdmin\", \"Admin\"\r\n , \"System\", \"System\"\r\n , \"Application\", \"Application\"\r\n , \"ServicePrincipal\", \"Service Principal\"\r\n , \"CustomPolicy\", \"Other\"\r\n , \"SystemPolicy\", \"Other\"\r\n , \"Reserved\", \"Other\"\r\n];\r\nlet eventtypes=datatable (op:string, EventType:string)\r\n[\r\n \"Remove\", \"Delete\",\r\n \"New\", \"Create\",\r\n \"Add\", \"Create\",\r\n \"Enable\", \"Enable\",\r\n \"Install\", \"Install\",\r\n \"Set\", \"Set\",\r\n \"Disable\", \"Disable\",\r\n \"disable\", \"Disable\"\r\n];\r\n let parser=  (\r\n      starttime:datetime=datetime(null), \r\n      endtime:datetime=datetime(null),\r\n      srcipaddr_has_any_prefix:dynamic=dynamic([]), \r\n      eventresult:string='*',\r\n      actorusername_has_any:dynamic=dynamic([]),\r\n      eventtype_in:dynamic=dynamic([]),\r\n      operation_has_any:dynamic=dynamic([]),\r\n      object_has_any:dynamic=dynamic([]),\r\n      newvalue_has_any:dynamic=dynamic([]),\r\n      disabled:bool = false\r\n  ){\r\n  OfficeActivity\r\n  | where not(disabled)\r\n  | where\r\n      (isnull(starttime) or TimeGenerated >= starttime) \r\n      and (isnull(endtime) or TimeGenerated <= endtime)\r\n  | where RecordType  in ('ExchangeAdmin')\r\n  | where \r\n      (array_length(srcipaddr_has_any_prefix) == 0 or has_any_ipv4_prefix(ClientIP,srcipaddr_has_any_prefix))\r\n      and (array_length(actorusername_has_any) == 0 or UserId has_any (actorusername_has_any))\r\n      and (array_length(operation_has_any) == 0 or Operation has_any (operation_has_any))\r\n      and (array_length(object_has_any) == 0 or OfficeObjectId has_any (object_has_any))\r\n      and (array_length(newvalue_has_any) == 0 or Parameters has_any (newvalue_has_any))\r\n  | project Operation, ResultStatus, Parameters, OrganizationName, OrganizationId, OfficeObjectId, ClientIP, UserId, UserKey, UserAgent, UserType, TimeGenerated, OriginatingServer, SourceRecordId, Type, _ResourceId\r\n  // --\r\n  // Calculate and filter result\r\n  | where (eventresult == \"*\" or (eventresult == \"Success\" and ResultStatus == \"True\"))\r\n  | extend EventResult = iff(ResultStatus == \"True\", \"Success\", \"Failure\")\r\n  // --\r\n  // -- Calculate and filter operation and event type\r\n  | extend \r\n      SplitOp = split (Operation,\"-\")\r\n  | extend\r\n      op=tostring(SplitOp[0])\r\n  | lookup eventtypes on op\r\n  | where array_length(eventtype_in) == 0 or EventType in (eventtype_in)\r\n  | project-away op    \r\n  // --\r\n  // Calculate and post-filter source IP address and port\r\n  | extend \r\n      SplitIpAddr = extract_all(@'^\\[?(.*?)\\]?:(\\d+)$', ClientIP)[0]\r\n  | extend \r\n      SrcIpAddr = iff (SplitIpAddr[1] == \"\", ClientIP, SplitIpAddr[0]),\r\n      SrcPortNumber = toint(iff (SplitIpAddr[1] == \"\", \"\", SplitIpAddr[1]))\r\n  | where (array_length(srcipaddr_has_any_prefix) == 0 or has_any_ipv4_prefix(SrcIpAddr,srcipaddr_has_any_prefix))\r\n  // --\r\n  /// Calculate and post filter actor and acting app\r\n  | parse UserId with ActorUsername \" (\" ActingAppName \")\"\r\n  | extend \r\n      ActorUsernameType = iff (ActorUsername == \"\", \"UPN\", \"Windows\"),\r\n      ActorUsername = iff (ActorUsername == \"\", UserId, ActorUsername),\r\n      ActingAppType = iff (ActingAppName == \"\", \"\", \"Process\")\r\n  | where (array_length(actorusername_has_any) == 0 or ActorUsername has_any (actorusername_has_any))\r\n  // --\r\n  // Calculate Object\r\n  | extend\r\n      SplitObject = extract_all(@'^(.*?)[\\\\/](.*)$', OfficeObjectId)[0]\r\n  | extend \r\n      Object = case (\r\n          SplitObject[0] == OrganizationName, SplitObject[1], \r\n          OfficeObjectId == \"\", SplitOp[1],\r\n          OfficeObjectId\r\n      )\r\n  | project-away SplitOp, OfficeObjectId\r\n  // --\r\n  | project-rename\r\n      SrcDescription = OriginatingServer,\r\n      NewValue = Parameters \r\n  | project-away SplitObject, UserKey, SplitIpAddr, ClientIP, UserId\r\n  | project-rename\r\n      HttpUserAgent = UserAgent, \r\n      ActorOriginalUserType = UserType,\r\n      ActorScopeId = OrganizationId,\r\n      ActorScope = OrganizationName,\r\n      EventOriginalUid = SourceRecordId\r\n  | lookup usertypes on ActorOriginalUserType\r\n  | extend\r\n      EventCount = int(1),\r\n      EventStartTime = TimeGenerated, \r\n      EventEndTime= TimeGenerated,\r\n      EventProduct = 'Exchange 365',\r\n      EventVendor = 'Microsoft',\r\n      EventSchemaVersion = '0.1.0',\r\n      EventSchema = 'AuditEvent',\r\n      TargetAppName = 'Exchange 365',\r\n      TargetAppType = 'SaaS application'\r\n  | project-away \r\n      ResultStatus\r\n  | extend\r\n      EventSeverity = iff(EventResult == \"Failure\", \"Low\", \"Informational\")\r\n  // -- Aliases\r\n  | extend \r\n      User=ActorUsername,\r\n      IpAddr = SrcIpAddr,\r\n      Value = NewValue,\r\n      Application = TargetAppName,\r\n      Dst = TargetAppName,\r\n      Src = coalesce (SrcIpAddr, SrcDescription),\r\n      Dvc = TargetAppName,\r\n  // -- Entity identifier explicit aliases\r\n      ActorUserUpn = iif (ActorUsernameType == \"UPN\", ActorUsername, \"\"),\r\n      ActorWindowsUsername = iif (ActorUsernameType == \"Windows\", ActorUsername, \"\")\r\n };\r\n parser (\r\n    starttime = starttime,\r\n    endtime = endtime,\r\n    srcipaddr_has_any_prefix = srcipaddr_has_any_prefix,\r\n    actorusername_has_any = actorusername_has_any,\r\n    eventtype_in = eventtype_in,\r\n    eventresult = eventresult,\r\n    operation_has_any = operation_has_any,\r\n    object_has_any=object_has_any,\r\n    newvalue_has_any=newvalue_has_any,\r\n    disabled=disabled\r\n )", "params": "starttime:datetime = datetime(null), endtime:datetime = datetime(null), srcipaddr_has_any_prefix:dynamic = dynamic([]), actorusername_has_any:dynamic = dynamic([]), operation_has_any:dynamic = dynamic([]), eventtype_in:dynamic = dynamic([]), eventresult:string = '*', object_has_any:dynamic = dynamic([]), newvalue_has_any:dynamic = dynamic([]), disabled:bool = false"}}